In [2]:
import pandas as pd
from pathlib import Path

In [4]:
csvpath= Path('../Resources/order_data.csv')
df= pd.read_csv(csvpath, index_col= "order_no")
df.sample(5)

          customer_no order_total  order_date
order_no
45251825     CJ458565       14.00  04/25/2019
452517125    CM458565     $141.25  01-10-2019
413853121    CM458565         NaN   4/24/2019
452519232         NaN     $141.25  01-10-2019
45235825       TV4663       65.42  04-29-2019

In [5]:
df.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

In [7]:
df.count()

customer_no    7
order_total    7
order_date     8
dtype: int64

In [8]:
df["customer_no"].value_counts()

CM458565    2
AK45765     2
TV4663      1
CJ458565    1
2124        1
Name: customer_no, dtype: int64

In [9]:
df.isnull()

            customer_no  order_total  order_date
order_no
452517125         False        False       False
45251825          False        False       False
4465241327        False        False       False
4465241327        False        False       False
413853121         False         True       False
45235825          False        False       False
2356363           False        False       False
452519232          True        False       False

In [10]:
df.isnull().mean()*100

customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

In [11]:
df.isnull().sum()

customer_no    1
order_total    1
order_date     0
dtype: int64

In [20]:
df= df.fillna(0)
df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232            0     $141.25  01-10-2019

In [15]:
df= df.dropna().copy()
df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232            0     $141.25  01-10-2019

In [16]:
df.isnull().sum()

customer_no    0
order_total    0
order_date     0
dtype: int64

In [19]:
df.duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
dtype: bool

In [21]:
df["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [23]:
df= df.drop_duplicates().copy()
df["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [24]:
df.head()

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019

In [25]:
df["order_total"]= df["order_total"].str.replace("$","")
df["order_total"]

order_no
452517125        141.25
45251825          14.00
4465241327      1103.36
45235825          65.42
2356363       258936.12
452519232        141.25
Name: order_total, dtype: object

In [26]:
df["order_total"]= df["order_total"].astype('float')

In [27]:
df.dtypes

customer_no     object
order_total    float64
order_date      object
dtype: object